app/Controllers/Admin/EmpresaController.php

SELECT *
FROM `empresa`
WHERE `empresa`.`id` = '1'
---
    public function detalhes($id)
    {
        $empresa = $this->empresaModel->find($id);

SELECT *
FROM `empresa`
WHERE `empresa`.`id` = '1'
---
    public function form($id = null)
    {
        $empresa = null;
        if ($id) {
            $empresa = $this->empresaModel->find($id);