app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
---
    public function index()
    {
        $usuario = service('autenticacao');

        $data = [
            'titulo'   => 'Listando usuários',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(10),