app/Models/EmpresaModel.php

SELECT *
FROM `empresa`
 LIMIT 1
---
    public function getDadosEmpresa()
    {

        return $this->first();