app/Models/MedidaModel.php

SELECT `id`, `nome`
FROM `medidas`
WHERE `nome` LIKE '%gg%' ESCAPE '!'
---
     public function procurar($term)
    {
        if (null == $term) {
            return [];
        }

        return $this->select('id, nome')
            ->like('nome', $term)
            ->withDeleted(true)
            ->get()
            ->getResult();