app/Models/PedidoItemModel.php

SELECT `pedidos_itens`.`id`, `pedidos_itens`.`quantidade`, `pedidos_itens`.`observacao`, `produtos`.`nome` AS `produto_nome`, `medidas`.`nome` AS `medida_nome`
FROM `pedidos_itens`
JOIN `produtos` ON `produtos`.`id` = `pedidos_itens`.`produto_id`
JOIN `produtos_especificacoes` ON `produtos_especificacoes`.`id` = `pedidos_itens`.`especificacao_id`
JOIN `medidas` ON `medidas`.`id` = `produtos_especificacoes`.`medida_id`
WHERE `pedidos_itens`.`pedido_id` = 4
---
    public function recuperaItensDoPedidoParaImpressao(int $pedido_id): array
    {
        return $this->select([
                'pedidos_itens.id', // ID do item para buscar os extras
                'pedidos_itens.quantidade',
                   'pedidos_itens.observacao',
                'produtos.nome AS produto_nome',
                'medidas.nome AS medida_nome',
            ])
            ->join('produtos', 'produtos.id = pedidos_itens.produto_id')
            ->join('produtos_especificacoes', 'produtos_especificacoes.id = pedidos_itens.especificacao_id')
            ->join('medidas', 'medidas.id = produtos_especificacoes.medida_id')
            ->where('pedidos_itens.pedido_id', $pedido_id)
            ->findAll();

SELECT `pedidos_itens`.`quantidade`, `pedidos_itens`.`preco_unitario`, `produtos`.`nome` AS `produto_nome`, `medidas`.`nome` AS `medida_nome`
FROM `pedidos_itens`
JOIN `produtos` ON `produtos`.`id` = `pedidos_itens`.`produto_id`
JOIN `produtos_especificacoes` ON `produtos_especificacoes`.`id` = `pedidos_itens`.`especificacao_id`
JOIN `medidas` ON `medidas`.`id` = `produtos_especificacoes`.`medida_id`
WHERE `pedidos_itens`.`pedido_id` = 3
---
    public function recuperaItensDoPedidoParaModal(int $pedido_id): array
    {
        // 1. Buscamos os itens do pedido
        $itens = $this->select([
            'pedidos_itens.id', // Precisamos do ID do item para buscar os extras
            'pedidos_itens.quantidade',
            'pedidos_itens.preco_unitario', // Buscando o preço que foi salvo no pedido
            'pedidos_itens.observacao AS observacoes', // Alias para evitar conflito
            'produtos.nome AS produto_nome',
            'medidas.nome AS medida_nome',
        ])
        ->join('produtos', 'produtos.id = pedidos_itens.produto_id')
        ->join('produtos_especificacoes', 'produtos_especificacoes.id = pedidos_itens.especificacao_id')
        ->join('medidas', 'medidas.id = produtos_especificacoes.medida_id', 'left')
        ->where('pedidos_itens.pedido_id', $pedido_id)
        ->findAll();