app/Models/PedidoItemExtraModel.php

SELECT `extras`.`nome`
FROM `pedidos_itens_extras`
JOIN `extras` ON `extras`.`id` = `pedidos_itens_extras`.`extra_id`
WHERE `pedidos_itens_extras`.`pedido_item_id` = 16
---
    public function recuperaExtrasDoItem(int $pedido_item_id): array
    {
        return $this->select('extras.nome')
            ->join('extras', 'extras.id = pedidos_itens_extras.extra_id')
            ->where('pedidos_itens_extras.pedido_item_id', $pedido_item_id)
            ->findAll();