app/Models/PedidoModel.php

SELECT `pedidos`.*, `usuarios`.`nome` AS `cliente_nome`, `formas_pagamento`.`nome` AS `forma_pagamento_nome`
FROM `pedidos`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `pedidos`.`usuario_id`
LEFT JOIN `formas_pagamento` ON `formas_pagamento`.`id` = `pedidos`.`forma_pagamento_id`
ORDER BY `pedidos`.`id` DESC
---
    public function recuperaUltimosPedidosParaDashboard(): array
    {
        // A mágica acontece aqui! Adicionamos o JOIN com 'formas_pagamento'
        // e selecionamos o seu nome, exatamente como na outra função.
        return $this->select([
                        'pedidos.*', // Usamos pedidos.* para garantir todos os campos do pedido
                        'usuarios.nome AS cliente_nome',
                        'formas_pagamento.nome AS forma_pagamento_nome', // CAMPO ADICIONADO
                    ])
                    ->join('usuarios', 'usuarios.id = pedidos.usuario_id', 'left')
                    ->join('formas_pagamento', 'formas_pagamento.id = pedidos.forma_pagamento_id', 'left') // JOIN ADICIONADO
                    ->orderBy('pedidos.id', 'DESC')
                    ->limit(10)
                    ->findAll();

SELECT `status`, COUNT(id) as total
FROM `pedidos`
WHERE `criado_em` >= '2025-07-01 00:00:00'
AND `criado_em` <= '2025-08-01 23:59:59'
GROUP BY `status`
ORDER BY `total` DESC
SELECT COUNT(*) AS `numrows`
FROM `pedidos`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `pedidos`.`usuario_id`
LEFT JOIN `formas_pagamento` ON `formas_pagamento`.`id` = `pedidos`.`forma_pagamento_id`
---
      public function recuperaPedidosPaginados(array $filtros, int $perPage = 10): array
    {
        $builder = $this->select([
            'pedidos.id',
            'pedidos.status',
            'pedidos.valor_total',
            'pedidos.entregador_id',
            'pedidos.criado_em',
            'usuarios.nome AS cliente_nome',
            'formas_pagamento.nome AS forma_pagamento_nome',
        ])
        ->join('usuarios', 'usuarios.id = pedidos.usuario_id', 'left') // Usar 'left' join é mais seguro
        ->join('formas_pagamento', 'formas_pagamento.id = pedidos.forma_pagamento_id', 'left');

        if (!empty($filtros['busca'])) {
            $builder->like('pedidos.id', $filtros['busca']); // Pesquisar por código é mais comum
        }

        if (!empty($filtros['status'])) {
            $builder->where('pedidos.status', $filtros['status']);
        }

        return $builder->orderBy('pedidos.id', 'DESC')->paginate($perPage);

SELECT SUM(`valor_total`) AS `valor_total`
FROM `pedidos`
WHERE `status` = 'entregue'
AND `criado_em` >= '2025-07-01 00:00:00'
AND `criado_em` <= '2025-07-31 23:59:59'
---
    public function valorPedidosDoMes(): float
    {
        $primeiroDiaDoMes = date('Y-m-01 00:00:00');
        $ultimoDiaDoMes   = date('Y-m-t 23:59:59');

        $resultado = $this->selectSum('valor_total')
                          ->where('status', 'entregue') // Mudei para 'entregue', que é um status mais comum para faturamento. Ajuste se o seu for 'finalizado'.
                          ->where('criado_em >=', $primeiroDiaDoMes)
                          ->where('criado_em <=', $ultimoDiaDoMes)
                          ->get()->getRow();

SELECT COUNT(*) AS `numrows`
FROM `pedidos`
WHERE `criado_em` >= '2025-07-01 00:00:00'
AND `criado_em` <= '2025-07-31 23:59:59'
---
    public function totalPedidosDoMes(): int
    {
        $primeiroDiaDoMes = date('Y-m-01 00:00:00');
        $ultimoDiaDoMes   = date('Y-m-t 23:59:59');

        return $this->where('criado_em >=', $primeiroDiaDoMes)
                    ->where('criado_em <=', $ultimoDiaDoMes)
                    ->countAllResults();

SELECT `status`, COUNT(id) as total
FROM `pedidos`
WHERE `criado_em` >= '2025-07-01 00:00:00'
AND `criado_em` <= '2025-07-31 23:59:59'
GROUP BY `status`
ORDER BY `total` DESC
---
    public function getStatusPedidosParaGrafico(): array
    {
        $primeiroDiaDoMes = date('Y-m-01 00:00:00');
        $ultimoDiaDoMes   = date('Y-m-t 23:59:59');

        return $this->select('status, COUNT(id) as total')
                    ->where('criado_em >=', $primeiroDiaDoMes)
                    ->where('criado_em <=', $ultimoDiaDoMes)
                    ->groupBy('status')
                    ->orderBy('total', 'DESC')
                    ->findAll();

SELECT `pedidos`.*, `formas_pagamento`.`nome` AS `forma_pagamento`, `entregadores`.`nome` AS `entregador_nome`, `usuarios_enderecos`.`logradouro`, `usuarios_enderecos`.`numero`, `usuarios_enderecos`.`cidade`, `usuarios_enderecos`.`estado`, `usuarios_enderecos`.`cep`, `bairros`.`nome` AS `bairro`, `bairros`.`valor_entrega` AS `taxa_entrega_bairro`
FROM `pedidos`
LEFT JOIN `formas_pagamento` ON `formas_pagamento`.`id` = `pedidos`.`forma_pagamento_id`
LEFT JOIN `usuarios_enderecos` ON `usuarios_enderecos`.`id` = `pedidos`.`endereco_id`
LEFT JOIN `entregadores` ON `entregadores`.`id` = `pedidos`.`entregador_id`
LEFT JOIN `bairros` ON `bairros`.`id` = `usuarios_enderecos`.`bairro`
WHERE `pedidos`.`id` = 3
AND `pedidos`.`usuario_id` = 1
 LIMIT 1
---
     public function recuperaDetalhesDoPedidoParaModal(int $pedido_id, int $usuario_id)
    {
        return $this->select([
                        'pedidos.*',
                        'formas_pagamento.nome AS forma_pagamento',
                        'entregadores.nome AS entregador_nome',

                        // Campos do endereço do usuário
                        'usuarios_enderecos.logradouro',
                        'usuarios_enderecos.numero',
                        'usuarios_enderecos.cidade',
                        'usuarios_enderecos.estado',
                        'usuarios_enderecos.cep',

                        // ✅ CORREÇÃO APLICADA AQUI:
                        // Pegamos o `nome` da tabela `bairros` e o chamamos de `bairro`
                        'bairros.nome AS bairro',
                        'bairros.valor_entrega AS taxa_entrega_bairro'
                    ])
                    ->join('formas_pagamento', 'formas_pagamento.id = pedidos.forma_pagamento_id', 'left')
                    ->join('usuarios_enderecos', 'usuarios_enderecos.id = pedidos.endereco_id', 'left')
                    ->join('entregadores', 'entregadores.id = pedidos.entregador_id', 'left')

                    // ✅ ESTA É A LINHA MAIS IMPORTANTE DA CORREÇÃO:
                    // Juntamos a tabela `bairros` usando o ID que está na coluna `usuarios_enderecos.bairro`.
                    ->join('bairros', 'bairros.id = usuarios_enderecos.bairro', 'left')

                    ->where('pedidos.id', $pedido_id)
                    ->where('pedidos.usuario_id', $usuario_id)
                    ->first();

SELECT `pedidos`.*, `usuarios`.`nome` AS `cliente_nome`, `formas_pagamento`.`nome` AS `forma_pagamento_nome`, `entregadores`.`nome` AS `entregador_nome`, `usuarios_enderecos`.`logradouro`, `usuarios_enderecos`.`numero`, `usuarios_enderecos`.`complemento`, `usuarios_enderecos`.`referencia`, `usuarios_enderecos`.`cidade`, `usuarios_enderecos`.`estado`, `usuarios_enderecos`.`cep`, `bairros`.`nome` AS `bairro_nome`, `bairros`.`valor_entrega` AS `taxa_entrega_bairro`
FROM `pedidos`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `pedidos`.`usuario_id`
LEFT JOIN `formas_pagamento` ON `formas_pagamento`.`id` = `pedidos`.`forma_pagamento_id`
LEFT JOIN `entregadores` ON `entregadores`.`id` = `pedidos`.`entregador_id`
LEFT JOIN `usuarios_enderecos` ON `usuarios_enderecos`.`id` = `pedidos`.`endereco_id`
LEFT JOIN `bairros` ON `bairros`.`id` = `usuarios_enderecos`.`bairro`
WHERE `pedidos`.`id` = 4
 LIMIT 1
---
    public function recuperaPedidoParaImpressao(int $pedido_id)
    {
        $pedido = $this->select([
                                'pedidos.*', // This already includes 'observacoes'
                                'usuarios.nome AS cliente_nome',
                                'formas_pagamento.nome AS forma_pagamento_nome',
                                'entregadores.nome AS entregador_nome',

                                // Campos do endereço do usuário
                                'usuarios_enderecos.logradouro',
                                'usuarios_enderecos.numero',
                                'usuarios_enderecos.complemento',
                                'usuarios_enderecos.referencia',
                                'usuarios_enderecos.cidade',
                                'usuarios_enderecos.estado',
                                'usuarios_enderecos.cep',

                                // Nome do bairro e taxa de entrega
                                'bairros.nome AS bairro_nome',
                                'bairros.valor_entrega AS taxa_entrega_bairro'
                            ])
                            ->join('usuarios', 'usuarios.id = pedidos.usuario_id', 'left')
                            ->join('formas_pagamento', 'formas_pagamento.id = pedidos.forma_pagamento_id', 'left')
                            ->join('entregadores', 'entregadores.id = pedidos.entregador_id', 'left')
                            ->join('usuarios_enderecos', 'usuarios_enderecos.id = pedidos.endereco_id', 'left')
                            ->join('bairros', 'bairros.id = usuarios_enderecos.bairro', 'left')
                            ->where('pedidos.id', $pedido_id)
                            ->first();