app/Models/PedidoModel.php

     public function valorPedidosDoPeriodo(string $dataInicio, string $dataFim): float
    {
        $primeiroDia = $dataInicio . ' 00:00:00';
        $ultimoDia = $dataFim . ' 23:59:59';

        $resultado = $this->selectSum('valor_total')
                          ->where('status', 'entregue')
                          ->where('criado_em >=', $primeiroDia)
                          ->where('criado_em <=', $ultimoDia)
                          ->get()->getRow();
---
SELECT SUM(`valor_total`) AS `valor_total`
FROM `pedidos`
WHERE `status` = 'entregue'
AND `criado_em` >= '2025-07-01 00:00:00'
AND `criado_em` <= '2025-08-01 23:59:59'